def l(x, y, a, n):
    f = 0
    for i in range(n + 1):
        l = 1
        for j in range(n + 1):
            if i != j:
                l *= (a - x[j]) / (x[i] - x[j])
        f += l * y[i]
    return round(f, 4)
n = 13
x1 = (40 - 1.33 * n) * 0.01  
x2 = (80 + 1.57 * n) * 0.01    
x3 = (180 - 1.15 * n) * 0.01 
x = [0, 0.2, 0.4, 0.6, 0.8, 1, 1.2, 1.4, 1.6, 1.8]
y = [1, 1.099, 1.0780, 1.1708, 1.2937, 1.4427, 1.6144, 1.8061, 2.0161, 2.2429]
print("ТЕМА 4. ИНТЕРПОЛИРОВАНИЕ И ЭКСТРАПОЛИРОВАНИЕ".center(50))
print("ФУНКЦИЙ. ПРАКТИЧЕСКОЕ ЗАНЯТИЕ.".center(50))
print("СОСТАВЛЕНИЕ ИНТЕРПОЛЯЦИОННЫХ ФОРМУЛ".center(50))
print("ЛАГРАНЖА, НЬЮТОНА.".center(50))
print("=" * 50)
print(f"x1={x1:.4f}, x2={x2:.4f}, x3={x3:.4f}")
print()
print("=" * 50)
print("ЛАГРАНЖ".center(50))
print("=" * 50) 
print("Лагранж 1 степени x1 =", l([x[1], x[2]], [y[1], y[2]], x1, 1))
print("Лагранж 1 степени x2 =", l([x[4], x[5]], [y[4], y[5]], x2, 1))
print("Лагранж 1 степени x3 =", l([x[8], x[9]], [y[8], y[9]], x3, 1))
print("Лагранж 2 степени x1 =", l([x[0], x[1], x[2]], [y[0], y[1], y[2]], x1, 2))
print("Лагранж 2 степени x2 =", l([x[4], x[5], x[6]], [y[4], y[5], y[6]], x2, 2))
print("Лагранж 2 степени x3 =", l([x[7], x[8], x[9]], [y[7], y[8], y[9]], x3, 2))
print("По формуле Ньютона пока нет)))Скоро будет")
input()